Repository: visol/ext-userimport
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# moduleTitle
source: User Import
de: Benutzer-Import

# uploadFile.label
source: Select file
de: Datei auswählen

# uploadStorageFolder.label
source: Upload folder
de: Upload-Verzeichnis

# uploadStorageFolder.missing
source: You must configure an upload folder in the Extension Manager configuration. See README for more details.
de: Bitte Upload-Verzeichnis im Extension Manager konfigurieren. Siehe README für mehr Details.

# seeExtensionManager.help
source: (See extension manager)
de: (siehe Extension Manager)

# uploadFile.help
source: Allowed file extensions are: xlsx, csv
de: Erlaubte Datei-Typen sind: xlsx, csv

# uploadSubmit.label
source: Upload
de: Hochladen

# spreadsheetPreview.header
source: Preview (File: %s)
de: Vorschau (Datei: %s)

# spreadsheetPreview.help
source: Only the first 5 rows are displayed.
de: Es werden nur die ersten 5 Zeilen dargestellt.

# importOptions.header
source: Import options
de: Import-Optionen

# importOptions.option.firstRowContainsFieldNames.label
source: First row contains field names
de: Erste Zeile enthält Spaltennamen

# importOptions.option.firstRowContainsFieldNames.help
source: If selected, the first row is ignored when importing.
de: Falls gewählt, wird die erste Zeile beim Import ignoriert.

# importOptions.option.targetFolder.label
source: Target folder
de: Ziel-Ordner

# importOptions.option.userGroups.label
source: User groups
de: Benutzergruppen

# importOptions.option.userGroups.help
source: The selected user groups are assigned to the created users.
de: Die ausgewählten Benutzergruppen werden den importierten Benutzern zugewiesen.

# importOptions.option.useEmailAsUsername.label
source: Use e-mail column as username
de: E-Mail-Spalte als Benutzername verwenden

# importOptions.option.useEmailAsUsername.help
source: The value of the e-mail column is used as username.
de: Der Wert der Spalte E-Mail wird als Benutzername verwendet.

# importOptions.option.generatePassword.label
source: Generate password
de: Kennwort generieren

# importOptions.option.generatePassword.help
source: A random password is generated for imported users. Alternatively, you can import a password column.
de: Ein zufälliges Kennwort wird für importierte Benutzer generiert. Alternativ kann das Kennwort auch importiert werden.

# importOptions.option.updateExistingUsers.label
source: Update existing users
de: Bestehende Benutzer aktualisieren

# importOptions.option.updateExistingUsers.help
source: Update existing users instead of adding new users.
de: Anstatt neue Benutzer hinzuzufügen, werden bestehende Benutzer aktualisiert.

# importOptions.option.updateExistingUsersUniqueField.label
source: Field to check for update
de: Feld für Aktualisierungs-Prüfung

# importOptions.option.updateExistingUsersUniqueField.help
source: If a record having the same value in the selected field is found, it is updated instead of inserted.
de: Ein Benutzer wird dann aktualisiert, wenn bereits ein Benutzer mit demselben Wert im angegebenen Feld existiert.

# importOptionsSubmit.label
source: Continue
de: Weiter

# fieldMapping.header
source: Field Mapping
de: Feldzuweisung

# fieldMapping.tableHeader.column
source: Column
de: Spalte

# fieldMapping.tableHeader.feUserMapping
source: Field mapping
de: Feldzuweisung

# fieldMapping.tableHeader.examples
source: Examples
de: Beispiele

# fieldMapping.feUserMapping.placeholder
source: Map to field...
de: Zuweisung zu Feld...

# fieldMapping.validation.usernameMustBeMapped
source: The username field must be mapped.
de: Das Feld username muss zugewiesen werden.

# fieldMapping.validation.emailMustBeMapped
source: The e-mail field must be mapped because the username is generated from it.
de: Das Feld email muss zugewiesen werden, da daraus der Benutzername generiert wird.

# fieldMappingSubmit.label
source: Continue
de: Weiter

# importPreview.header
source: Import Preview
de: Import-Vorschau

# importPreviewSubmit.label
source: Import data
de: Daten importieren

# performImport.rowsInSource
source: %s rows in source file.
de: %s Zeilen in der hochgeladenen Datei.

# performImport.insertedRecords
source: %s records inserted.
de: %s Datensätze importiert.

# performImport.updatedRecords
source: %s records updated.
de: %s Datensätze aktualisiert.

# error.1399312430
source: File extension not allowed. Allowed file types: xlsx, csv
de: Datei-Typ nicht erlaubt. Erlaubte Datei-Typen: xlsx, csv

# performImport.update.fail
source: Update failed for: %s
de: Aktualisierung fehlgeschlagen für: %s

# performImport.update.moreThanOneRecordFound
source: Update failed for: %s (Reason: More than one identical record to update was found.)
de: Aktualisierung fehlgeschlagen für: %s (Grund: Mehr als ein identischer Datensatz für die Aktualisierung gefunden.)

# performImport.update.success
source: Update successful for: %s
de: Aktualisierung erfolgreich für: %s

# performImport.insert.fail
source: Insert failed for: %s
de: Import fehlgeschlagen für: %s

# performImport.insert.success
source: Insert successful for: %s
de: Import erfolgreich für: %s

# performImport.goToTargetFolder
source: Go to target folder
de: Zum Zielordner wechseln
